{"config": [{"config": {"center": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_regularizer": null, "trainable": true, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "batch_input_shape": [null, 80, 160, 3], "gamma_constraint": null, "dtype": "float32", "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "Conv1", "trainable": true, "bias_regularizer": null, "filters": 60, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "Conv2", "trainable": true, "bias_regularizer": null, "filters": 50, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "Conv3", "trainable": true, "bias_regularizer": null, "filters": 40, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Conv4", "trainable": true, "bias_regularizer": null, "filters": 30, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Conv5", "trainable": true, "bias_regularizer": null, "filters": 20, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "Conv6", "trainable": true, "bias_regularizer": null, "filters": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Conv7", "trainable": true, "bias_regularizer": null, "filters": 5, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"name": "Deconv1", "trainable": true, "bias_regularizer": null, "filters": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Deconv2", "trainable": true, "bias_regularizer": null, "filters": 20, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "dropout_7", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"name": "Deconv3", "trainable": true, "bias_regularizer": null, "filters": 30, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "dropout_8", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Deconv4", "trainable": true, "bias_regularizer": null, "filters": 40, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "dropout_9", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "Deconv5", "trainable": true, "bias_regularizer": null, "filters": 50, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "dropout_10", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"name": "Deconv6", "trainable": true, "bias_regularizer": null, "filters": 60, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}, {"config": {"name": "Final", "trainable": true, "bias_regularizer": null, "filters": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2DTranspose"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}